const MY_NEWS_DATABASE = [
    {
        id: "news-3",
        date: "14.07.2026",
        title: "Добро пожаловать на H&CR!",
        category: "САЙТ",
        image: "images/news/news4.png",
        featured: true,
        
        // Можно использовать теги <b>жирный</b> или ссылки <a class="text-orange-500" href="...">ссылка</a>

        text: `
            Это случилось! После 40 000 попыток и 3 месяцев стримов, игрок наконец-то смог пройти финальную часть. Уровень официально занимает первую строчку нашего листа.

            Разработчики уже подтвердили, что геймплей получился максимально сбалансированным, несмотря на безумную сложность таймингов. Видео верификации уже доступно на официальном канале.
        `
    },
    {
        id: "news-2",
        date: "21.06.2026",
        title: "Новый топ-1 демон официально верифицирован!",
        category: "Демонлист",
        image: "images/news/news2.png",
        featured: false,
        text: `
            Это случилось! После 40 000 попыток и 3 месяцев стримов, <a class="text-orange-500 inline-block transition-transform duration-300 hover:scale-110" href="player.html?id=51613">
    wPopoff
</a> наконец-то смог пройти новый топ-1 демон. Уровень официально занимает первую строчку листа на поинтеркрейте, сдвинув с трона Thinking Space 2.

            Разработчики уже подтвердили, что геймплей получился максимально сбалансированным, несмотря на безумную сложность таймингов. Видео верификации уже доступно на официальном канале.
        `
    },
    {
        id: "news-1",
        date: "05.07.2026",
        title: "Технические работы и обновление дизайна",
        category: "САЙТ",
        image: "images/news/news1.png",
        featured: false,
        text: `
            Мы полностью переработали UX/UI главной страницы. Теперь структура сайта (сайдбары, топ игроков, СТРИМЫ И ПРОГРЕССЫ) загружается мгновенно, а данные плавно подтягиваются из таблиц.

            Если вы заметили баг или у вас поплыла верстка — обязательно пишите в наш Telegram! Мы постараемся исправить всё как можно быстрее.
        `
    }
];
